using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class ProposalDataSource
{

    private static int i = 0;
    public static Proposal getRandomProposal()
    {
        Proposal p1 = new Proposal();
        p1.title = "จ้างก่อสร้างถนนผิวจราจรแอสฟัลท์คอนกรีต สายบ้านรวมทรัพย์ - บ้านหนองภิรมย์ หมู่ที่ ๖,๑๖ ตำบลภูน้ำหยด อำเภอวิเชียรบุรี จังหวัดเพชรบูรณ์ โดยวิธีคัดเลือก";
        p1.description = "ก่อสร้างถนนผิวจราจรแอสฟัลท์คอนกีต กว้าง ๖.๐๐ เมตร ไหล่ทางข้างละ ๑.๐๐ เมตร รวมผิวจราจรกว้าง ๘.๐๐ เมตร ยาว ๙,๔๓๘.๐๐ เมตร หนา ๐.๐๕ เมตร หรือมีพื้นที่ผิวจราจร แอสฟัลท์คอนกรีตไม่น้อยกว่า ๗๕,๕๐๔ ตารางเมตร พร้อมรางระบายน้ำ คสล.ในสายทาง รายละเอียดตามแบบแปลนขององค์การบริหารส่วนจังหวัดเพชรบูรณ์ กำหนด";
        p1.budget = 39558000f;
        p1.deptName = "องค์การบริหารส่วนจังหวัดเพชรบูรณ์";

        Proposal p2 = new Proposal();
        p2.title = "ประกวดราคาจ้างก่อสร้างจ้างปรับปรุงห้องประชุม อารีย์สัมพันธ์อาคารกรมส่งเสริมคุณภาพสิ่งแวดล้อม ด้วยวิธีประกวดราคาอิเล็กทรอนิกส์ (e-bidding)";
        p2.description = "อาคารกรมส่งเสริมคุณภาพสิ่งแวดล้อม ตั้งอยู่ เลขที่ 49 ซอย 30 ถนนพระราม 6 แขวงพญาไท เขตพญาไท กรุงเทพมหานคร ได้ก่อตั้งมาเป็นระยะเวลา 19 ปี ซึ่งภายในอาคารมีห้องประชุมขนาดใหญ่ (อารีย์สัมพันธ์) สำหรับใช้ในการจัดประชุม อบรม สัมมนา ให้กับบุคลากรภายในและภายนอกกรมส่งเสริมคุณภาพสิ่งแวดล้อม อาทิ อบรมผู้บริหารระดับต้น ผู้บริหารระดับสูง การประชุมคณะนายกรัฐมนตรีและรองนายกรัฐมนตรี รวมทั้งใช้ในการจัดกิจกรรมต่างๆ ภายในกรมส่งเสริมคุณภาพสิ่งแวดล้อม\nปัจจุบันห้องประชุมอารีย์สัมพันธ์มีสภาพชำรุดทรุดโทรมเป็นอย่างมาก เนื่องจากมีการใช้งานมาอย่างต่อเนื่องและยาวนาน รวมทั้งเครื่องมือเครื่องใช้และวัสดุอุปกรณ์ต่างๆ ก็มีสภาพที่เก่าไม่สามารถเชื่อมต่อให้ใช้งานร่วมกับเทคโนโลยีสมัยใหม่ได้อย่างมีประสิทธิภาพ การดำเนินการซ่อมแซมที่ผ่านมาเป็นเพียงเพื่อให้พอสามารถใช้งานได้เท่านั้น ดังนั้น กรมส่งเสริมฯ จึงมีความจำเป็นต้องดำเนินการปรับปรุงห้องประชุมอารีย์สัมพันธ์ให้มีความทันสมัย เพื่อให้สอดคล้องกับบริบทใหม่ของกรมส่งเสรมิคุณภาพสิ่งแวดล้อม โดยมีรายละเอียดดังนี้\n1. งานรื้อถอนพื้น ผนัง และฝ้าเพดาน\n2. งานปรับปรุงสถาปัตยกรรม\n3. งานปรับปรุงระบบไฟฟ้า\n4. งานปรับปรุงระบบปรับอากาศ\n5. งานจัดหาครุภัณฑ์พร้อมติดตั้งและทดสอบระบบ";
        p2.budget = 9325000f;
        p2.deptName = "กรมส่งเสริมคุณภาพสิ่งแวดล้อม / กรมส่งเสริมคุณภาพสิ่งแวดล้อม กรุงเทพฯ";

        if (i == 0)
        {
            Debug.Log("Returning first proposal");
            i++;
            return p1;
        }
        else
        {
            Debug.Log("Returning second proposal");
            i = 0;
            return p2;
        }
    }
}
